In [43]:

import pandas as pd
dict1={'Name':['Om','Naina','Khusi','Radhe','Happy',
 'Ishaan','Priti'],
 'Marks':[90,78,78,89,56,90,85],
 'Gender':['Male','Female','Female','Male','Male',
 'Male','Female']}
df1=pd.DataFrame(dict1)

df1

     Name  Marks  Gender
0      Om     90    Male
1   Naina     78  Female
2   Khusi     78  Female
3   Radhe     89    Male
4   Happy     56    Male
5  Ishaan     90    Male
6   Priti     85  Female

# Display top 3 rows of the data set

In [44]:
df1.head(3)

    Name  Marks  Gender
0     Om     90    Male
1  Naina     78  Female
2  Khusi     78  Female

# Check last 3 rows of the dataset

In [45]:
df1.tail(3)

     Name  Marks  Gender
4   Happy     56    Male
5  Ishaan     90    Male
6   Priti     85  Female

# Find the no of rows and no of columns of the dataset

In [46]:
df1.shape

(7, 3)

In [47]:
print('no of rows',df1.shape[0])
print('no of columns',df1.shape[1])

no of rows 7
no of columns 3

# Get information of the dataset

In [48]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    7 non-null      object
 1   Marks   7 non-null      int64
 2   Gender  7 non-null      object
dtypes: int64(1), object(2)
memory usage: 296.0+ bytes

# Check null values of the dataset

In [49]:
df1.isnull()

    Name  Marks  Gender
0  False  False   False
1  False  False   False
2  False  False   False
3  False  False   False
4  False  False   False
5  False  False   False
6  False  False   False

In [50]:
#displaying sum of null values column wise
df1.isnull().sum()

Name      0
Marks     0
Gender    0
dtype: int64

In [51]:
#displaying sum of null values column wise
df1.isnull().sum(axis=0)

Name      0
Marks     0
Gender    0
dtype: int64

In [52]:
#displaying sum of nullvalues row wise
df1.isnull().sum(axis=1)

0    0
1    0
2    0
3    0
4    0
5    0
6    0
dtype: int64

# Get overall statistics about dataframes

In [53]:
df1.describe()

           Marks
count   7.000000
mean   80.857143
std    12.143978
min    56.000000
25%    78.000000
50%    85.000000
75%    89.500000
max    90.000000

In [54]:
df1.describe(include='all')

       Name      Marks Gender
count     7   7.000000      7
unique    7        NaN      2
top      Om        NaN   Male
freq      1        NaN      4
mean    NaN  80.857143    NaN
std     NaN  12.143978    NaN
min     NaN  56.000000    NaN
25%     NaN  78.000000    NaN
50%     NaN  85.000000    NaN
75%     NaN  89.500000    NaN
max     NaN  90.000000    NaN

# Find unique values from the gender column

In [55]:
df1['Gender'].unique()

array(['Male', 'Female'], dtype=object)

# Find the number of unique values from the gender column

In [56]:
df1['Gender'].nunique()

2

# Display count of unique values in gender column

In [57]:
df1['Gender'].value_counts()

Male      4
Female    3
Name: Gender, dtype: int64

# Find the total no of student having marks between 90 to 100(inclusive)

In [58]:
df1['Marks']>=90

0     True
1    False
2    False
3    False
4    False
5     True
6    False
Name: Marks, dtype: bool

In [59]:
df1[df1['Marks']>=90]

     Name  Marks Gender
0      Om     90   Male
5  Ishaan     90   Male

In [60]:
#without using between method
len(df1[(df1['Marks']>=90 ) & (df1['Marks']<=100)])

2

In [61]:
#with using between method
sum(df1['Marks'].between(90,100))

2

# Find the average marks

In [62]:
df1['Marks'].mean()

80.85714285714286

In [63]:
print(df1['Marks'].min())
print(df1['Marks'].max())

56
90

# Apply method

In [64]:
def marks(x):
    return x/2
df1['Marks'].apply(marks)

0    45.0
1    39.0
2    39.0
3    44.5
4    28.0
5    45.0
6    42.5
Name: Marks, dtype: float64

In [65]:
df1['Half_marks']=df1['Marks'].apply(marks)

In [66]:
df1

     Name  Marks  Gender  Half_marks
0      Om     90    Male        45.0
1   Naina     78  Female        39.0
2   Khusi     78  Female        39.0
3   Radhe     89    Male        44.5
4   Happy     56    Male        28.0
5  Ishaan     90    Male        45.0
6   Priti     85  Female        42.5

In [67]:
df1['Marks'].apply(lambda x:x/2)

0    45.0
1    39.0
2    39.0
3    44.5
4    28.0
5    45.0
6    42.5
Name: Marks, dtype: float64

In [68]:
df1['Name'].apply(len)

0    2
1    5
2    5
3    5
4    5
5    6
6    5
Name: Name, dtype: int64

In [69]:
df1['Gender'].map({'Male':1,'Female':0})

0    1
1    0
2    0
3    1
4    1
5    1
6    0
Name: Gender, dtype: int64

In [70]:
df1['Male_Female']=df1['Gender'].map({'Male':1,'Female':0})

In [71]:
df1

     Name  Marks  Gender  Half_marks  Male_Female
0      Om     90    Male        45.0            1
1   Naina     78  Female        39.0            0
2   Khusi     78  Female        39.0            0
3   Radhe     89    Male        44.5            1
4   Happy     56    Male        28.0            1
5  Ishaan     90    Male        45.0            1
6   Priti     85  Female        42.5            0

# Drop the column

In [72]:
df1.drop(['Male_Female','Half_marks'],axis=1)

     Name  Marks  Gender
0      Om     90    Male
1   Naina     78  Female
2   Khusi     78  Female
3   Radhe     89    Male
4   Happy     56    Male
5  Ishaan     90    Male
6   Priti     85  Female

# print name of the columns

In [73]:
df1.columns

Index(['Name', 'Marks', 'Gender', 'Half_marks', 'Male_Female'], dtype='object')

In [74]:
df1.index

RangeIndex(start=0, stop=7, step=1)

# Sort the dataset as per the marks columnn

In [75]:
df1.sort_values(by='Marks')

     Name  Marks  Gender  Half_marks  Male_Female
4   Happy     56    Male        28.0            1
1   Naina     78  Female        39.0            0
2   Khusi     78  Female        39.0            0
6   Priti     85  Female        42.5            0
3   Radhe     89    Male        44.5            1
0      Om     90    Male        45.0            1
5  Ishaan     90    Male        45.0            1

In [76]:
df1.sort_values(by='Marks',ascending=False)

     Name  Marks  Gender  Half_marks  Male_Female
0      Om     90    Male        45.0            1
5  Ishaan     90    Male        45.0            1
3   Radhe     89    Male        44.5            1
6   Priti     85  Female        42.5            0
1   Naina     78  Female        39.0            0
2   Khusi     78  Female        39.0            0
4   Happy     56    Male        28.0            1

In [77]:
df1.sort_values(by=['Marks','Gender'],ascending=False)

     Name  Marks  Gender  Half_marks  Male_Female
0      Om     90    Male        45.0            1
5  Ishaan     90    Male        45.0            1
3   Radhe     89    Male        44.5            1
6   Priti     85  Female        42.5            0
1   Naina     78  Female        39.0            0
2   Khusi     78  Female        39.0            0
4   Happy     56    Male        28.0            1

# Display name and marks of female student only

In [78]:
df1[df1["Gender"]=='Female'][['Name','Marks']]

    Name  Marks
1  Naina     78
2  Khusi     78
6  Priti     85

In [79]:
df1[df1['Gender'].isin(['Female'])][['Name','Marks']]

    Name  Marks
1  Naina     78
2  Khusi     78
6  Priti     85